.\" @configure_input@
.\"
.\" neo4j-client - command shell for Neo4j
.\" Copyright 2016 Chris Leishman (http://github.com/cleishm)
.\"
.\" Licensed under the Apache License, Version 2.0 (the "License");
.\" you may not use this file except in compliance with the License.
.\" You may obtain a copy of the License at
.\"
.\"     http://www.apache.org/licenses/LICENSE-2.0
.\"
.\" Unless required by applicable law or agreed to in writing, software
.\" distributed under the License is distributed on an "AS IS" BASIS,
.\" WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
.\" See the License for the specific language governing permissions and
.\" limitations under the License.
.\"
.TH NEO4J-CLIENT 1
.SH NAME
neo4j\-client \- command shell for Neo4j
.SH SYNOPSIS
.B neo4j\-client \fI[options...] [URL]\fR
.SH "DESCRIPTION"
\fBneo4j\-client\fR is a command shell for Neo4j. It supports secure
connections to Neo4j server, sending of statements (including multiline
statements), persistent command history, and rendering of results to tables or
CSV.

\fBneo4j\-client\fR requires Neo4j Server version 3.0 or later.
.SH OPTIONS
.TP
.I \-h, \-\-help
Display a brief help listing.
.TP
.I \-\-history=file
Use the specified file for saving history.

By default, history is saved to \fI$(HOME)/.neo4j/client-history\fR.
.TP
.I \-\-no-history
Do not save the command history.
.TP
.I \-\-insecure
Do not attempt to establish a secure (TLS) connection to Neo4j.
.TP
.I \-\-known-hosts=file
When using secure (TLS) connections, the certificate signatures of previously
verified hosts is persisted to the known hosts file. This setting specifies
the location of that file.

By default, the file is \fI$(HOME)/.neo4j/neo4j_known_certs\fR.
.TP
.I \-v, \-\-verbose
Increase the logging verbosity. Each invocation increases the verbosity. Each
verbosity level roughly equates to logging of warnings, general information,
debug output and trace information.
.TP
.I \-\-version
Print the neo4j\-client version and exit.
.SH URL
A URL may be specified on the command line, and will cause \fBneo4j\-client\fR
to attempt to connect to the specified server immediately. The URL is of the
form \fIneo4j://host[:port]\fR, and specifies the host and port the Neo4j
server is listening on.
.SH INTERACTIVE MODE
When \fBneo4j\-client\fR is started with standard input connected to an
interactive terminal, it will run in interactive mode. This will present a
command prompt to the user and will evaluate each command as it is entered. The
history of entered commands will be saved (unless disabled) and an errors in
evaluation will be presented to the user. Results from statements sent to Neo4j
will be presented to the user in table format (by default), using the full
width of the terminal.
.SH BATCH (NON-INTERACTIVE) MODE
When \fBneo4j\-client\fR is started with standard intput connected to a pipe,
it will read statements from the pipe and evaluate each. Any error in
evaluation will cause \fBneo4j\-client\fR to terminate without evaluating any
further input. Results from statements sent to Neo4j will be output in CSV
format (by default).
.SH USAGE
Once started, commands and statements can be entered at the \fBneo4j\-client\fR
prompt. Commands always begin with a colon (:) and conclude at the end of the
line, e.g. \fI:help\fR, and are evaluated by \fBneo4j\-client\fR rather than
being sent to the Neo4j server. Statements do not begin with a colon (:), may
span multiple lines, are terminated with a semi-colon (;) and will be sent to
the Neo4j server for evaluation.
.SH COMMANDS
\fBneo4j\-client\fR understands a variety of commands, including:
.TP
.I :help
List all the available commands and usage information.
.TP
.I ":quit \fR(or \fI:exit\fR)\fI"
Exit \fBneo4j\-client\fR.
.TP
.I ":connect '<url>'"
Connect the Neo4j server specified by the URL. Note that the URL must be
given in quotes, as it will otherwise the \fI//\fR characters in the URL would
be considered as the start of a comment.
.TP
.I :disconnect
Disconnect from the Neo4j server (if connected).
.TP
.I ":output (table|csv)"
Set the output format to either table or CSV.
.TP
.I ":width <n>"
Set the output width for table rendering. \fIn\fR is either an integer between
2 and 4095, or \fIauto\fR. In interactive mode, the default is \fIauto\fR,
which sets the output width to match the width of the terminal. In batch
(non-interactive) mode, the default is 70.
.SH EXAMPLES
Start \fBneo4j\-client\fR in interactive mode, and run a query:

    $ neo4j-client neo4j://localhost:7687
    neo4j> MATCH (n:Person) RETURN n.name, n.born LIMIT 4;
    +-----------------------------+-----------------------------+
    | n.name                      | n.born                      |
    +-----------------------------+-----------------------------+
    | Keanu Reeves                | 1964                        |
    | Carrie-Anne Moss            | 1967                        |
    | Laurence Fishburne          | 1961                        |
    | Hugo Weaving                | 1960                        |
    +-----------------------------+-----------------------------+
    neo4j> :quit
    $

Evaluate a query using \fBneo4j\-client\fR in batch (non-interactive) mode,
saving the output to a csv file:

    $ echo "MATCH (n:Person) RETURN n.name, n.born LIMIT 4;" | \\
            neo4j\-client neo4j://localhost:7687 > result.csv
    $ cat result.csv
    "n.name","n.born"
    "Keanu Reeves",1964
    "Carrie-Anne Moss",1967
    "Laurence Fishburne",1961
    "Hugo Weaving",1960
    $
.SH ERRORS
In interactive mode, \fBneo4j\-client\fR attempts to exit cleanly (with
\fI$?\fR set to 0) when the session is terminated via the use of \fI:quit\fR,
\fI:exit\fR or \fIctrl-D\fR, and to use a non-zero exit code otherwise.
In batch (non-interactive) mode, \fBneo4j\-client\fR will exit cleanly if all
statements read from stdin evaluate successfully.
.SH VERSION
This man page is current for version @VERSION@ of neo4j\-client.
.SH COPYRIGHT
http://www.apache.org/licenses/LICENSE\-2.0
.SH AUTHORS
Chris Leishman (http://github.com/cleishm)
